cadastro/app/controllers/pessoas_controller.rb

SELECT "pessoas".* FROM "pessoas"
---
  def index
    @pessoas = Pessoa.all

INSERT INTO "pessoas" ("created_at", "email", "idade", "msg", "nome", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-30 22:57:09.803764"], ["email", "rodrigosol@gmail.com"], ["idade", 10], ["msg", "teste"], ["nome", "teste"], ["updated_at", "2014-09-30 22:57:09.803764"]]
---
  def create
    byebug
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save

SELECT  "pessoas".* FROM "pessoas"  WHERE "pessoas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pessoa
      @pessoa = Pessoa.find(params[:id])